In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('./scores.csv')

In [5]:
# 데이터 미리보기
df.head() # default 5개

      name    kor    eng   math
0    Aiden  100.0   90.0   95.0
1  Charles   90.0   80.0   75.0
2   Danial   95.0  100.0  100.0
3     Evan  100.0  100.0  100.0
4    Henry    NaN   35.0   60.0

In [6]:
df.tail() # default 5개

       name    kor    eng   math
25  Vanessa   95.0   70.0   95.0
26  Viviana  100.0   80.0  100.0
27   Vikkie    NaN   50.0  100.0
28   Winnie   70.0  100.0   70.0
29     Zuly   80.0   90.0   95.0

In [7]:
df.tail(3)

      name   kor    eng   math
27  Vikkie   NaN   50.0  100.0
28  Winnie  70.0  100.0   70.0
29    Zuly  80.0   90.0   95.0

랜덤 샘플 비율로 보기

- df.sample(frac = 0.2)
    - 지정한 비율의 샘플 출력

In [9]:
df.sample(frac = 0.5) # frac = 0.5 >> 50%만 추출

       name    kor    eng   math
28   Winnie   70.0  100.0   70.0
8    Justin   50.0   60.0  100.0
17     Emma   70.0   65.0   70.0
1   Charles   90.0   80.0   75.0
2    Danial   95.0  100.0  100.0
22     Rose   70.0   65.0   70.0
0     Aiden  100.0   90.0   95.0
27   Vikkie    NaN   50.0  100.0
9     Kevin  100.0  100.0   90.0
16    Ellen    NaN   60.0    NaN
20    Linda  100.0   90.0  100.0
23    Sofia  100.0  100.0  100.0
14    Chloe   95.0  100.0   95.0
12    Peter  100.0   95.0  100.0
10      Leo   90.0   95.0   70.0

높은 순서 / 낮은 순서 보기

높은 순 보기
- df.nlargest(갯수, 컬럼명)
    - 컬럼의 데이터가 숫자형일 때만 사용 가능

In [10]:
df.head()

      name    kor    eng   math
0    Aiden  100.0   90.0   95.0
1  Charles   90.0   80.0   75.0
2   Danial   95.0  100.0  100.0
3     Evan  100.0  100.0  100.0
4    Henry    NaN   35.0   60.0

In [11]:
df.nlargest(5, 'eng')

      name    kor    eng   math
2   Danial   95.0  100.0  100.0
3     Evan  100.0  100.0  100.0
5      Ian   90.0  100.0   90.0
9    Kevin  100.0  100.0   90.0
14   Chloe   95.0  100.0   95.0

In [12]:
df.nlargest(5, 'kor') # kor 높은 순으로 5개 보기

     name    kor    eng   math
0   Aiden  100.0   90.0   95.0
3    Evan  100.0  100.0  100.0
9   Kevin  100.0  100.0   90.0
12  Peter  100.0   95.0  100.0
15  Danna  100.0  100.0  100.0

낮은 순 보기
- df.nsmallest(갯수, 컬럼명)
    - 컬럼의 데이터가 숫자형일 때만 사용 가능

In [13]:
df.nsmallest(5,'eng')

        name   kor   eng   math
4      Henry   NaN  35.0   60.0
27    Vikkie   NaN  50.0  100.0
18  Jennifer  80.0  55.0   80.0
8     Justin  50.0  60.0  100.0
16     Ellen   NaN  60.0    NaN

데이터 요약보기
- (행, 열) 크기 보기

In [14]:
df.shape
# 30행 4열
# 30개의 redcord(정보), 4개의 속성정보(feature) 가 있다.

(30, 4)

In [15]:
df.shape[0] # 행(row) record 정보

30

In [16]:
df.shape[1] # duf(column) feature 정보

4

In [17]:
len(df) # len() : 데이터 크기 알려줌, length 약자

30

In [18]:
# 컬럼명 보기

df.columns

Index(['name', 'kor', 'eng', 'math'], dtype='object')

In [19]:
# 인덱스 보기
df.index

RangeIndex(start=0, stop=30, step=1)

In [20]:
# 데이터의 자료형보기
df.dtypes

name     object
kor     float64
eng     float64
math    float64
dtype: object

데이터 프레임 정보보기

In [23]:
# 데이터 프레임의 총 샘플 개수, 컬럼수, 컬럼별 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    30 non-null     object
 1   kor     27 non-null     float64
 2   eng     28 non-null     float64
 3   math    29 non-null     float64
dtypes: float64(3), object(1)
memory usage: 1.1+ KB

In [27]:
df.head()

      name    kor    eng   math
0    Aiden  100.0   90.0   95.0
1  Charles   90.0   80.0   75.0
2   Danial   95.0  100.0  100.0
3     Evan  100.0  100.0  100.0
4    Henry    NaN   35.0   60.0

In [28]:
df.kor

0     100.0
1      90.0
2      95.0
3     100.0
4       NaN
5      90.0
6      70.0
7      80.0
8      50.0
9     100.0
10     90.0
11     70.0
12    100.0
13     90.0
14     95.0
15    100.0
16      NaN
17     70.0
18     80.0
19     50.0
20    100.0
21     90.0
22     70.0
23    100.0
24     90.0
25     95.0
26    100.0
27      NaN
28     70.0
29     80.0
Name: kor, dtype: float64

In [29]:
df['kor']

0     100.0
1      90.0
2      95.0
3     100.0
4       NaN
5      90.0
6      70.0
7      80.0
8      50.0
9     100.0
10     90.0
11     70.0
12    100.0
13     90.0
14     95.0
15    100.0
16      NaN
17     70.0
18     80.0
19     50.0
20    100.0
21     90.0
22     70.0
23    100.0
24     90.0
25     95.0
26    100.0
27      NaN
28     70.0
29     80.0
Name: kor, dtype: float64

In [30]:
df['eng'].unique()
# 유일한 데이터 내용 확인하기 위함
# 중복데이터 제거하기 위해 확인 용도

array([ 90.,  80., 100.,  35.,  75.,  60.,  95.,  65.,  55.,  nan,  70.,
        50.])

In [36]:
df['eng'].value_counts()

100.0    8
90.0     4
75.0     3
80.0     2
60.0     2
95.0     2
65.0     2
70.0     2
35.0     1
55.0     1
50.0     1
Name: eng, dtype: int64

요약 통계 보기

In [39]:
df.describe()

              kor         eng        math
count   27.000000   28.000000   29.000000
mean    85.740741   80.892857   84.827586
std     15.045042   18.361270   15.950972
min     50.000000   35.000000   50.000000
25%     75.000000   68.750000   70.000000
50%     90.000000   85.000000   90.000000
75%    100.000000  100.000000  100.000000
max    100.000000  100.000000  100.000000

In [40]:
df['kor'].mean()

85.74074074074075